<?php

$a=5;
$b=10;

/*เพิ่มค่า*/
echo "ค่าเริ่มต้น = ".$a."<br>"; //5
echo "เพิ่มค่าแบบ prefix = ".(++$a)."<br>";
echo "ค่าล่าสุด ของ a = ".$a;

echo "<hr>";
$a=5;
echo "ค่าเริ่มต้น = ".$a."<br>"; //5
echo "เพิ่มค่าแบบ postfix = ".($a++)."<br>";
echo "ค่าล่าสุด ของ a = ".$a;

// ลดค่า
echo "<hr>";
$a=5;
echo "ค่าเริ่มต้น = ".$a."<br>"; //5
echo "ลดค่าแบบ prefix = ".(--$a)."<br>";
echo "ค่าล่าสุด ของ a = ".$a;

echo "<hr>";
$a=5;
echo "ค่าเริ่มต้น = ".$a."<br>"; //5
echo "ลดค่าแบบ postfix = ".($a--)."<br>";
echo "ค่าล่าสุด ของ a = ".$a;
echo "<hr>";
?>
